# 05 Importing Time Series Data

In [12]:
import pandas as pd
import numpy as np

In [13]:
n = np.nan
temperature = [23, 24, 27, n, n, 23, n, 28, n, 23, 28, 27, n, n, 23, 22, 27, n, n, 23]

In [17]:
day = list(range(1,21))
day

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [ ]:
temperature

[23,
 24,
 27,
 nan,
 nan,
 23,
 nan,
 28,
 nan,
 23,
 28,
 27,
 nan,
 nan,
 23,
 22,
 27,
 nan,
 nan,
 23]

In [ ]:
temperature_df = pd.DataFrame({'Day': day, 'Temperature': temperature})
temperature_df

    Day  Temperature
0     1         23.0
1     2         24.0
2     3         27.0
3     4          NaN
4     5          NaN
5     6         23.0
6     7          NaN
7     8         28.0
8     9          NaN
9    10         23.0
10   11         28.0
11   12         27.0
12   13          NaN
13   14          NaN
14   15         23.0
15   16         22.0
16   17         27.0
17   18          NaN
18   19          NaN
19   20         23.0

In [ ]:
temperature_df.fillna(method='ffill')

    Day  Temperature
0     1         23.0
1     2         24.0
2     3         27.0
3     4         27.0
4     5         27.0
5     6         23.0
6     7         23.0
7     8         28.0
8     9         28.0
9    10         23.0
10   11         28.0
11   12         27.0
12   13         27.0
13   14         27.0
14   15         23.0
15   16         22.0
16   17         27.0
17   18         27.0
18   19         27.0
19   20         23.0

In [ ]:
temperature_df.fillna(method='bfill', limit=1) #  axis=0

    Day  Temperature
0     1         23.0
1     2         24.0
2     3         27.0
3     4          NaN
4     5         23.0
5     6         23.0
6     7         28.0
7     8         28.0
8     9         23.0
9    10         23.0
10   11         28.0
11   12         27.0
12   13          NaN
13   14         23.0
14   15         23.0
15   16         22.0
16   17         27.0
17   18          NaN
18   19         23.0
19   20         23.0